erp3l/src/Catalogs/СтатьиДоходовИРасходовКИК/СтатьиДоходовИРасходовКИК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДоходовИРасходовКИК</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ДатаАудита</name>
      <description>Дата составления аудиторского заключения</description>
    </items>
    <items>
      <name>ДатаСоставления</name>
      <description>Дата составления финансовой отчетности за финансовый год</description>
    </items>
    <items>
      <name>ДатаПрибыли</name>
      <description>Дата, являющаяся последним днем периода, за который определяется прибыль контролируемой иностранной компании</description>
    </items>
    <items>
      <name>ДатаФинОтчетности</name>
      <description>Дата, являющаяся последним днем периода, за который составляется финансовая отчетность</description>
    </items>
    <items>
      <name>Код1001</name>
      <description>Код 1001</description>
    </items>
    <items>
      <name>Код1002</name>
      <description>Код 1002</description>
    </items>
    <items>
      <name>Код1003</name>
      <description>Код 1003</description>
    </items>
    <items>
      <name>Код1004</name>
      <description>Код 1004</description>
    </items>
    <items>
      <name>Код1005</name>
      <description>Код 1005</description>
    </items>
    <items>
      <name>Код1006</name>
      <description>Код 1006</description>
    </items>
    <items>
      <name>Код1007</name>
      <description>Код 1007</description>
    </items>
    <items>
      <name>Код1008</name>
      <description>Код 1008</description>
    </items>
    <items>
      <name>Код1009</name>
      <description>Код 1009</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидАналитики1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяНК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЭлементаНалоговойДекларации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодЭлементаНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Нефинансовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.ТипыЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>700</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КодыДляЗаполненияДеклараций</name>
    <attributes>
      <name>Декларация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/СтатьиДоходовИРасходовКИК/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбновлениеКодовДеклараций(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиДоходовИРасходовКИК.Ссылка КАК Ссылка,
		|	СтатьиДоходовИРасходовКИК.КодЭлементаНалоговойДекларации КАК КодЭлементаНалоговойДекларации,
		|	СтатьиДоходовИРасходовКИК.КодЭлементаНДФЛ КАК КодЭлементаНДФЛ
		|ИЗ
		|	Справочник.СтатьиДоходовИРасходовКИК КАК СтатьиДоходовИРасходовКИК
		|ГДЕ
		|	СтатьиДоходовИРасходовКИК.ПометкаУдаления = ЛОЖЬ
		|	И (СтатьиДоходовИРасходовКИК.КодЭлементаНалоговойДекларации <> """"
		|			ИЛИ СтатьиДоходовИРасходовКИК.КодЭлементаНДФЛ <> """")";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ВыборкаДетальныеЗаписи.КодЭлементаНалоговойДекларации <> "" Тогда
			НовСтрока = Объект.КодыДляЗаполненияДеклараций.Добавить();
			НовСтрока.Декларация = "РегламентированныйОтчетПрибыль.ФормаОтчета2016Кв4";
			НовСтрока.Код = ВыборкаДетальныеЗаписи.КодЭлементаНалоговойДекларации;
			НовСтрока = Объект.КодыДляЗаполненияДеклараций.Добавить();
			НовСтрока.Декларация = "РегламентированныйОтчетПрибыль.ФормаОтчета2019Кв4";
			НовСтрока.Код = ВыборкаДетальныеЗаписи.КодЭлементаНалоговойДекларации;
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.КодЭлементаНДФЛ <> "" Тогда
			НовСтрока = Объект.КодыДляЗаполненияДеклараций.Добавить();
			НовСтрока.Декларация = "РегламентированныйОтчет3НДФЛ.ФормаОтчета2017кв1";
			НовСтрока.Код = ВыборкаДетальныеЗаписи.КодЭлементаНДФЛ;
			НовСтрока = Объект.КодыДляЗаполненияДеклараций.Добавить();
			НовСтрока.Декларация = "РегламентированныйОтчет3НДФЛ.ФормаОтчета2018кв1";
			НовСтрока.Код = ВыборкаДетальныеЗаписи.КодЭлементаНДФЛ;
		КонецЕсли;
		Объект.Записать();
	КонецЦикла;

КонецПроцедуры

Процедура ОбновлениеПредопределенныхЭлементов(Параметры = Неопределено) Экспорт
	
	СтрокаПредопределенныхКодов = "П0009А0001101,П0009А0001102,П0009А0001103,П0009А0001104,П0009А0001105,П0009А0001106,П0009А0001107,П0009А0001108,П0009А0001109,ПВ_3,ПВ_4,ПВ_5,ПВ_6";
	СоответствиеПредопределенныхЭлементов = Новый Соответствие;
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001101", Справочники.СтатьиДоходовИРасходовКИК.Код1001);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001102", Справочники.СтатьиДоходовИРасходовКИК.Код1002);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001103", Справочники.СтатьиДоходовИРасходовКИК.Код1003);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001104", Справочники.СтатьиДоходовИРасходовКИК.Код1004);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001105", Справочники.СтатьиДоходовИРасходовКИК.Код1005);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001106", Справочники.СтатьиДоходовИРасходовКИК.Код1006);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001107", Справочники.СтатьиДоходовИРасходовКИК.Код1007);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001108", Справочники.СтатьиДоходовИРасходовКИК.Код1008);
	СоответствиеПредопределенныхЭлементов.Вставить("П0009А0001109", Справочники.СтатьиДоходовИРасходовКИК.Код1009);
	СоответствиеПредопределенныхЭлементов.Вставить("ПВ_3", Справочники.СтатьиДоходовИРасходовКИК.ДатаФинОтчетности);
	СоответствиеПредопределенныхЭлементов.Вставить("ПВ_4", Справочники.СтатьиДоходовИРасходовКИК.ДатаСоставления);
	СоответствиеПредопределенныхЭлементов.Вставить("ПВ_5", Справочники.СтатьиДоходовИРасходовКИК.ДатаПрибыли);
	СоответствиеПредопределенныхЭлементов.Вставить("ПВ_6", Справочники.СтатьиДоходовИРасходовКИК.ДатаАудита);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиДоходовИРасходовКИК.Ссылка КАК Ссылка,
		|	СтатьиДоходовИРасходовКИК.Код КАК Код
		|ИЗ
		|	Справочник.СтатьиДоходовИРасходовКИК КАК СтатьиДоходовИРасходовКИК
		|ГДЕ
		|	СтатьиДоходовИРасходовКИК.Код В(&Код)
		|	И СтатьиДоходовИРасходовКИК.ПометкаУдаления = ЛОЖЬ
		|	И СтатьиДоходовИРасходовКИК.Предопределенный = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Код", СтрРазделить(СтрокаПредопределенныхКодов, ","));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИмяПредопределенныхДанных = СоответствиеПредопределенныхЭлементов.Получить(ВыборкаДетальныеЗаписи.Код).ИмяПредопределенныхДанных;
		Объект1 = СоответствиеПредопределенныхЭлементов.Получить(ВыборкаДетальныеЗаписи.Код).ПолучитьОбъект();
		Объект1.ИмяПредопределенныхДанных = "";
		Объект1.Записать();
		Объект2 = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Объект2.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
		Объект2.Записать();
		Объект1.ПометкаУдаления = Истина;
		Объект1.Записать();
	КонецЦикла;
	ЗафиксироватьТранзакцию();
КонецПроцедуры

#КонецЕсли
